In [13]:
"""
@author: swaathi
"""

'\n@author: swaathi\n'

In [14]:
import pandas as pd

In [15]:
raw_mrg_df =  pd.read_csv('avgMarriageAgeRaw.csv', sep=',', encoding='latin-1')

In [16]:
raw_mrg_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1935 entries, 0 to 1934
Data columns (total 4 columns):
 #   Column                             Non-Null Count  Dtype
---  ------                             --------------  -----
 0   Entity                             1935 non-null   object
 1   Code                               1907 non-null   object
 2   Year                               1935 non-null   int64
 3   Estimated average age at marriage  1935 non-null   float64
dtypes: float64(1), int64(1), object(2)
memory usage: 60.6+ KB

In [17]:
#renaming columns
raw_mrg_df = raw_mrg_df.rename(columns={'Entity': 'Country', 'Estimated average age at marriage':'Average age'})

In [18]:
#remove unnecessary column
raw_mrg_df = raw_mrg_df[['Country', 'Year', 'Average age']]

In [19]:
raw_mrg_df.describe()

              Year  Average age
count  1935.000000  1935.000000
mean   2000.927649    25.485271
std      11.184545     3.563782
min    1970.000000    15.000000
25%    1994.000000    22.600000
50%    2002.000000    25.600000
75%    2010.000000    28.200001
max    2018.000000    33.799999

The data before 2001 is not relevant for the analysis. Hence, it will be removed

In [20]:
raw_mrg_df = raw_mrg_df[raw_mrg_df['Year'] > 2000]

In [21]:
raw_mrg_df.describe()

              Year  Average age
count  1075.000000  1075.000000
mean   2009.003721    26.378791
std       4.789225     3.620876
min    2001.000000    17.000000
25%    2005.000000    23.450000
50%    2009.000000    26.900000
75%    2013.000000    29.250000
max    2018.000000    33.799999

Only the latest data for each country is required for analysis. So, older data would be removed.

In [22]:
mrg_df = raw_mrg_df.groupby(['Country'])['Average age'].last()
mrg_df = mrg_df.reset_index(name = 'Avg. age')

In [23]:
mrg_df

               Country   Avg. age
0          Afghanistan  21.500000
1              Albania  24.200001
2              Algeria  28.200001
3               Angola  21.500000
4             Anguilla  28.600000
..                 ...        ...
211           Viet Nam  22.799999
212  Wallis and Futuna  27.799999
213              Yemen  22.799999
214             Zambia  21.799999
215           Zimbabwe  21.100000

[216 rows x 2 columns]

In [24]:
mrg_df.to_json('../Data_Analysis/cleanedMrgdata.json', orient='records')